package chap_01;

import java.sql.SQLOutput;

public class test {
    public static void main(String[] args) {

        // 1번문제 동명이인을 찾을거야 (나와 같은이름을 가진사람이면) 동명이인 (아니면) 동명이인이 아닙니다!
        //동명이인인가 아닌가를 출력.
        // 비교할 이름(최원효)입력값 = a 내 이름b 입력값 최상철 조건1 동명이인이면 = c 조건2 아니면 = d
        //동명이인 or 아님 을 출력 출력값 f
        // 변수 = (조건) ? (t) : (f)
        //등호같은건 검색 해도됨

        //System.out.println(("최상철"=="최원효") ? ("동명이인ㅇ") : ("동명이인ㄴ"));
        //System.out.println(("최상철"!="최원효") ? ("동명이인ㄴ") : ("동명이인ㅇ"));


        // 2번문제 철수와 영희가 수학점수를 받았어 철수는 54점을 받았고 영희는 67점을 받았어 그런데 이중 점수가 더 높은 사람을
        // (이름)우승자로 출력해주고싶어
        // 철수 점수 54    영희점수67   (이름)우승! -> 출력값
        // 누가 더 높은가? 비교식
        //
        // "높은쪽+ 우승!"

        //String c = (54>67) ? ("a+ 우승!") : ("b+ 우승!");
        //String d = (54<67) ? ("b+ 우승!") : ("a+ 우승!");
       // System.out.println(c+"\n"+d);


        // 3번문
        // 우리 집앞에 어떤새기가 담배꽁초를 버렷어
        // 이게 과연 사회적으로 맞는행동인지 확인해보고싶어 그런데 나는 비흡연자라 절대 안된다 생각하거든?
        // 내 친구가 둘이 같이 있길래 물어볼래
        // 그래서 한명이라도 그럴수 있다라고 하면 그럴수 있지라고 생각할래   ||
        // 그래서 찬반 토론을 하고싶어
        // 1번사람은 트루(불리언 타입의 트루)야
        // 2번사람은 펄스(불리언 타입의 펄스야)야
        // 그래서 맞으면 100 틀리면 0을 알려주고싶어
        // 변수 = (조건) ? (t) : (f)

        //
        // System.out.println((false||false) ? (100) : (0));

        //System.out.println(c = (a||b) ? (100) : (0));

        //System.out.println((5>3) || (2 < 0));












    }
}



